FKDD_COPY_DIFF_3_2026-02-14/Reports/АнализНеликвидовЗапчастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>АнализНеликвидовЗапчастей</Name>
			<Comment>Анализ неликвидов запчастей</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Comment>Выводить дополнительные группировок в отдельной колонке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Comment>Имя регистра для запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНастройки</Name>
					<Comment>Режим настройки отчета: стандарт, эксперт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
					<Comment>Параметры измерений строк</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтоотступ</Name>
					<Comment>Истина - использовать автоотступ при выводе отчета, Ложь - не использовать автоотступ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапасПервыйПредел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапасВторойПредел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритичныйЗапас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРасчетаСебестоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДляРасчетаТекущегоРасхода</Name>
					<Comment>Количество дней для расчета текущего расхода</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляЦены</Name>
					<Comment>Подразделение для стоимости по типу цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтозаполнениеПолей</Name>
					<Comment>Автозаполнение полей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНеликвидов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПретендентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Comment>Ширина колонки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
					<Comment>Таблица измерений строк отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения строки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
					<Comment>Таблица измерений колонок отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения колонки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип измерения колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Reports/АнализНеликвидовЗапчастей/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем ТекстЗапроса Экспорт;                            // хранит текст запроса
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // Параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета
Перем ПоследовательностиОтчета Экспорт;                // хранит последовательность отчета

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// возвращает текст запроса
Функция ПолучитьТекстЗапроса() Экспорт
	
	ТекстЗапросаРезультат               = "";
	ТекстТаблицыИзРегистраИзмерения     = "";
	ТекстГруппировокРегистра            = "";
	ТекстТабРасходовИзмерения           = "";
	ТекстТабРасходовГруппировки         = "";
	ТекстСоединенияТабРасходовРегистров = "";
	ТекстСоединенияТабРасходовОстатков  = "";
	ТекстВыбора                         = "";
	ТекстУпорядочить                    = "";
	ТекстИтогов                         = "";
	ЕстьКонтрагент                      = Ложь;
	ЕстьСклад                           = Ложь;
	ЕстьПодразделение                   = Ложь;
	
	СтрокаИтоговВыборПоСкладу = "ВЫБОР
	|		КОГДА СкладКомпании ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			СУММА(ДоляСебестоимости)
	|	КОНЕЦ КАК ДоляСебестоимости";
	
	СтрокаИтоговВыборПоСкладу2 = "ВЫБОР
	|		КОГДА СкладКомпании ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			СУММА(ДоляВАссортименте)
	|	КОНЕЦ КАК ДоляВАссортименте";
	// подготовка строчек группировки
	Для Каждого ТекГруппировка Из ИзмеренияСтроки Цикл
		Если ТекГруппировка.Использование И ТекГруппировка.ПутьКДанным <> "ГруппаТоваров" И ТекГруппировка.ПутьКДанным <> "Номенклатура" Тогда
			ТекстТаблицыИзРегистраИзмерения = ТекстТаблицыИзРегистраИзмерения +
			"ПартииТоваровКомпании."+?(Найти(ТекГруппировка.ПутьКДанным, "Контрагент") = 1, "Партия.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Подразделение") = 1, "СкладКомпании.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Организация") = 1, "СкладКомпании.","")+
			ТекГруппировка.ПутьКДанным + " КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
			
			ТекстГруппировокРегистра = ТекстГруппировокРегистра +
			"ПартииТоваровКомпании."+?(ТекГруппировка.ПутьКДанным = "Контрагент", "Партия.","") +
			?(Найти(ТекГруппировка.ПутьКДанным, "Подразделение") = 1, "СкладКомпании.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Организация") = 1, "СкладКомпании.","")+
			ТекГруппировка.ПутьКДанным + "," + Символы.ПС;
			
			
			ТекстТабРасходовИзмерения = ТекстТабРасходовИзмерения +
			"ТаблицаРегистра." + ТекГруппировка.ПутьКДанным +
			" КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
			
			ТекстТабРасходовГруппировки = ТекстТабРасходовГруппировки +
			"ТаблицаРегистра." + ТекГруппировка.ПутьКДанным + "," + Символы.ПС;
			
			ТекстСоединенияТабРасходовРегистров = ТекстСоединенияТабРасходовРегистров +
			//?(ПустаяСтрока(ТекстСоединенияТабРасходовРегистров),"","И ")+
			" И 
			|	ТаблицаРегистра." + ТекГруппировка.ПутьКДанным + " = " +
			"ТаблицаРасходов." + ТекГруппировка.ПутьКДанным + Символы.ПС;
			
			ТекстСоединенияТабРасходовОстатков = ТекстСоединенияТабРасходовОстатков +
			//?(ПустаяСтрока(ТекстСоединенияТабРасходовОстатков),"","И ")+
			" И 
			|	ТаблицаРегистра." + ТекГруппировка.ПутьКДанным + " = " +
			"Остатки." +?(Найти(ТекГруппировка.ПутьКДанным, "Контрагент") = 1, "Партия.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Подразделение") = 1, "СкладКомпании.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Организация") = 1, "СкладКомпании.","")+
			ТекГруппировка.ПутьКДанным + Символы.ПС;
			
			ТекстВыбора = ТекстВыбора + ТекГруппировка.ПутьКДанным + ".* КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
			ТекстУпорядочить = ТекстУпорядочить + ТекГруппировка.ПутьКДанным + ".* КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
		КонецЕсли;
		
		Если ТекГруппировка.Использование  И ТекГруппировка.ПутьКДанным <> "Номенклатура"Тогда
			ТекстИтогов = ТекстИтогов + ТекГруппировка.ПутьКДанным + " КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
		КонецЕсли;
		
		Если ТекГруппировка.ПутьКДанным = "Контрагент" И  ТекГруппировка.Использование Тогда
			ЕстьКонтрагент = Истина;
		КонецЕсли;
		
		Если ТекГруппировка.ПутьКДанным = "СкладКомпании" И  ТекГруппировка.Использование Тогда
			ЕстьСклад = Истина;
		КонецЕсли;
		
		Если ТекГруппировка.ПутьКДанным = "Подразделение" И  ТекГруппировка.Использование Тогда
			ЕстьПодразделение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекГруппировка Из ИзмеренияКолонки Цикл
		Если ТекГруппировка.Использование И ТекГруппировка.ПутьКДанным <> "ГруппаТоваров" И ТекГруппировка.ПутьКДанным <> "Номенклатура" Тогда
			ТекстТаблицыИзРегистраИзмерения = ТекстТаблицыИзРегистраИзмерения +
			"ПартииТоваровКомпании."+?(Найти(ТекГруппировка.ПутьКДанным, "Контрагент") = 1, "Партия.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Подразделение") = 1, "СкладКомпании.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Организация") = 1, "СкладКомпании.","")+
			ТекГруппировка.ПутьКДанным + " КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
			
			ТекстГруппировокРегистра = ТекстГруппировокРегистра +
			"ПартииТоваровКомпании."+?(ТекГруппировка.ПутьКДанным = "Контрагент", "Партия.","") +
			?(Найти(ТекГруппировка.ПутьКДанным, "Подразделение") = 1, "СкладКомпании.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Организация") = 1, "СкладКомпании.","")+
			ТекГруппировка.ПутьКДанным + "," + Символы.ПС;
			
			
			ТекстТабРасходовИзмерения = ТекстТабРасходовИзмерения +
			"ТаблицаРегистра." + ТекГруппировка.ПутьКДанным +
			" КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
			
			ТекстТабРасходовГруппировки = ТекстТабРасходовГруппировки +
			"ТаблицаРегистра." + ТекГруппировка.ПутьКДанным + "," + Символы.ПС;
			
			ТекстСоединенияТабРасходовРегистров = ТекстСоединенияТабРасходовРегистров +
			//?(ПустаяСтрока(ТекстСоединенияТабРасходовРегистров),"","И ")+
			" И 
			|	ТаблицаРегистра." + ТекГруппировка.ПутьКДанным + " = " +
			"ТаблицаРасходов." + ТекГруппировка.ПутьКДанным + Символы.ПС;
			
			ТекстСоединенияТабРасходовОстатков = ТекстСоединенияТабРасходовОстатков +
			//?(ПустаяСтрока(ТекстСоединенияТабРасходовОстатков),"","И ")+
			" И 
			|	ТаблицаРегистра." + ТекГруппировка.ПутьКДанным + " = " +
			"Остатки." +?(Найти(ТекГруппировка.ПутьКДанным, "Контрагент") = 1, "Партия.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Подразделение") = 1, "СкладКомпании.","")+
			?(Найти(ТекГруппировка.ПутьКДанным, "Организация") = 1, "СкладКомпании.","")+
			ТекГруппировка.ПутьКДанным + Символы.ПС;
			
			ТекстВыбора = ТекстВыбора + ТекГруппировка.ПутьКДанным + ".* КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
			ТекстУпорядочить = ТекстУпорядочить + ТекГруппировка.ПутьКДанным + ".* КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
		КонецЕсли;
		
		Если ТекГруппировка.Использование  И ТекГруппировка.ПутьКДанным <> "Номенклатура"Тогда
			ТекстИтогов = ТекстИтогов + ТекГруппировка.ПутьКДанным + " КАК " + ПолучитьИмяПоля(ТекГруппировка.ПутьКДанным) + "," + Символы.ПС;
		КонецЕсли;
		
		Если ТекГруппировка.ПутьКДанным = "Контрагент" И  ТекГруппировка.Использование Тогда
			ЕстьКонтрагент = Истина;
		КонецЕсли;
		
		Если ТекГруппировка.ПутьКДанным = "СкладКомпании" И  ТекГруппировка.Использование Тогда
			ЕстьСклад = Истина;
		КонецЕсли;
		
		Если ТекГруппировка.ПутьКДанным = "Подразделение" И  ТекГруппировка.Использование Тогда
			ЕстьПодразделение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	СтрЗапросаСвойств      = "";
	СтрПсевдонимСвойств    = "";
	СтрЗапросаИтогиСвойств = "";
	СтрОтборСвойств        = "";
	СтрСоединенийСвойств   = "";
	СтрГруппировкиСвойств  = "";
	
	ОписанияПолейВЗапросе = Новый Структура;
	Если ЕстьСклад Тогда
		ОписанияПолейВЗапросе.Вставить("СкладКомпании", "СкладКомпании");
	КонецЕсли;
	ОписанияПолейВЗапросе.Вставить("Номенклатура" , "Номенклатура");
	Если ЕстьКонтрагент Тогда
		ОписанияПолейВЗапросе.Вставить("Контрагент"   , "Контрагент");
	КонецЕсли;
	Если ЕстьПодразделение Тогда
		ОписанияПолейВЗапросе.Вставить("Подразделение", "Подразделение");
	КонецЕсли;

	Для Каждого ТекСвойство Из СтруктураСвязиСвойств Цикл
		ИмяСвойства = СтрЗаменить(ТекСвойство.Ключ, "Значение", "");
		НаименованиеСвойства = ТекСвойство.Значение.Представление;
		ИмяПараметра = ТекСвойство.Значение.ИмяПараметра;
		Если НЕ ЕстьКонтрагент И (ТекСвойство.Значение.ИмяИзмерения = "Контрагент") Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ПутьКДаннымПоля = "ТабНеликвидовИКандидатов." + ОписанияПолейВЗапросе[ТекСвойство.Значение.ИмяИзмерения];
		Исключение
			Продолжить;
		КонецПопытки;
		
		ПостроительОтчета.Параметры.Вставить(ИмяПараметра, ТекСвойство.Значение.Свойство);
		
		ТипСвойства = отПолучитьСтрокуФорматаВыраженияПоТипу(ТекСвойство.Значение.Свойство.ТипЗначения);
		
		//ЗапросСвойстваПоля      = ","+Символы.ПС+"ВЫРАЗИТЬ(" + ИмяСвойства + ".Значение КАК " + ТипСвойства + ") КАК " + ИмяСвойства + "Значение";
		ЗапросСвойстваПоля      = ","+Символы.ПС+
			отПолчитьЗначениеСвойства(ИмяСвойства, ТипСвойства) +" КАК " + ИмяСвойства + "Значение";
		//ЗапросСвойстваГруппы    = ","+Символы.ПС+"ВЫРАЗИТЬ(" + ИмяСвойства + ".Значение КАК " + ТипСвойства + ") КАК " + ИмяСвойства + "Значение";
		ЗапросСвойстваГруппы    = ","+Символы.ПС+
			отПолчитьЗначениеСвойства(ИмяСвойства, ТипСвойства) + " КАК " + ИмяСвойства + "Значение";
		ЗапросСвойстваПсевдоним  = ","+Символы.ПС+ИмяСвойства+"Значение КАК "+ИмяСвойства+"Значение";
		ЗапросСвойстваИтоги 	 = ","+Символы.ПС+"МАКСИМУМ(" + ИмяСвойства + "Значение)";
		//ЗапросСвойстваОтборы     = ", ВЫРАЗИТЬ(" + ИмяСвойства + ".Значение КАК " + ТипСвойства + ") КАК " + ИмяСвойства + "Значение";
		ЗапросСвойстваОтборы    = ","+Символы.ПС+
			отПолчитьЗначениеСвойства(ИмяСвойства, ТипСвойства) + " КАК " + ИмяСвойства + "Значение";
		ЗапросСвойстваСоединение = "{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК " + ИмяСвойства + " ПО " + ИмяСвойства + ".Объект = " + ПутьКДаннымПоля + " И " + ИмяСвойства + ".Свойство = &" + ИмяПараметра + "}" + Символы.ПС;
		
		СтрГруппировкиСвойств  = СтрГруппировкиСвойств  + ЗапросСвойстваГруппы;
		СтрЗапросаСвойств      = СтрЗапросаСвойств      + ЗапросСвойстваПоля;
		СтрПсевдонимСвойств    = СтрПсевдонимСвойств    + ЗапросСвойстваПсевдоним;
		СтрЗапросаИтогиСвойств = СтрЗапросаИтогиСвойств + ЗапросСвойстваИтоги;
		СтрОтборСвойств        = СтрОтборСвойств        + ЗапросСвойстваОтборы;
		СтрСоединенийСвойств   = СтрСоединенийСвойств   + ЗапросСвойстваСоединение;
	КонецЦикла;
	
	ПоВалютеУчета = (ТипЦенРасчетаСебестоимости.ВВалютеУчета);
	
	ТекстЗапросаРезультат = "
	|	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	"+?(ЕстьСклад, "ОстаткиПоСкладу.СкладКомпании КАК СкладКомпании,","")+"
	|	ОстаткиПоСкладу.СуммаОстаток КАК ОбщСумма,
	|	ОстаткиПоСкладу.КоличествоОстаток КАК ОбщКоличПоКаталогу
	|ПОМЕСТИТЬ ТабРасчетаДолей
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонДляОстатка,) КАК ОстаткиПоСкладу
	|;
	|
	|ВЫБРАТЬ
	|	"+СтрЗаменить(ТекстТабРасходовИзмерения, "ТаблицаРегистра", "ТаблицаОстатков")+"
	|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
	|	ВЫБОР КОГДА
	|		СУММА(ТаблицаОстатков.НачальныйЗапас2) = 0 ТОГДА
	|			2
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК ГруппаТоваров,
	//|	ВЫБОР
	//|		КОГДА СУММА(ТаблицаОстатков.Оборот)>0 ТОГДА
	//|			 ""Претенденты в неликвидные товары""
	//|		ИНАЧЕ 
	//|			""Неликвидные товары""
	//|	КОНЕЦ КАК ГруппаТоваров,
	|	СУММА(ТаблицаОстатков.Сумма) КАК Себестоимость,
	|	СУММА(ТаблицаОстатков.СуммаУпр) КАК СебестоимостьУпр,
	|	СУММА(ТаблицаОстатков.НачальныйЗапас) КАК НачальныйЗапас,
	|	СУММА(ТаблицаОстатков.НачальныйЗапас2) КАК НачальныйЗапас2,
	|	СУММА(ТаблицаОстатков.Оборот) КАК ОборотПродаж,
	|	СУММА(ТаблицаОстатков.Оборот2) КАК ОборотПродаж2,
	|	СУММА(ТаблицаОстатков.КонечныйЗапас) КАК КонечныйЗапас
	|ПОМЕСТИТЬ
	|	ТабНеликвидовИКандидатовВрем
	|ИЗ
	|(ВЫБРАТЬ
	|	"+СтрЗаменить(ТекстТаблицыИзРегистраИзмерения, "ПартииТоваровКомпании.", "Остатки.")+"
	|	Остатки.Номенклатура КАК Номенклатура,
	|	0 КАК Сумма,
	|	0 КАК СуммаУпр,
	|	Остатки.КоличествоОстаток КАК НачальныйЗапас,
	|	0 КАК НачальныйЗапас2,
	|	0 КАК Оборот,
	|	0 КАК Оборот2,
	|	0 КАК КонечныйЗапас
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонДляОстатка, Партия.Дата <= &ДатаПретендентов
	|{
	|     Номенклатура.*      КАК Номенклатура,
	|     СкладКомпании.*     КАК СкладКомпании,
	|     Партия.*            КАК Партия,
	|     Партия.Контрагент.* КАК Контрагент,
	|     СкладКомпании.Подразделение.* КАК Подразделение,
	|     СкладКомпании.Организация.* КАК Организация
	|}) КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"+СтрЗаменить(ТекстТаблицыИзРегистраИзмерения, "ПартииТоваровКомпании.", "Остатки.")+"
	|	Остатки.Номенклатура,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА Остатки.Партия = &ПартияТоваровОтрицательныхОстатков ТОГДА
	|			0
	|		КОГДА Остатки.Партия.Дата <= &ДатаНеликвидов ТОГДА
	|			Остатки.КоличествоОстаток
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	Остатки.КоличествоОстаток,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонДляОстатка, Партия.Дата <= &ДатаНеликвидов
	|{
	|     Номенклатура.*      КАК Номенклатура,
	|     СкладКомпании.*     КАК СкладКомпании,
	|     Партия.*            КАК Партия,
	|     Партия.Контрагент.* КАК Контрагент,
	|     СкладКомпании.Подразделение.* КАК Подразделение,
	|     СкладКомпании.Организация.* КАК Организация
	|}) КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"+СтрЗаменить(ТекстТаблицыИзРегистраИзмерения, "ПартииТоваровКомпании.", "Остатки.")+"
	|	Остатки.Номенклатура,
	|	Остатки.СуммаОстаток,
	|	Остатки.СуммаУпрОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	Остатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонДляОстатка, Партия.Дата <= &ДатаПретендентов 
	|{
	|     Номенклатура.*      КАК Номенклатура,
	|     СкладКомпании.*     КАК СкладКомпании,
	|     Партия.*            КАК Партия,
	|     Партия.Контрагент.* КАК Контрагент,
	|     СкладКомпании.Подразделение.* КАК Подразделение,
	|     СкладКомпании.Организация.* КАК Организация
	|}) КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"+ТекстТаблицыИзРегистраИзмерения+"
	|	ПартииТоваровКомпании.Номенклатура,
	|	0,
	|	0,
	|	0,
	|	0,
	//<<БАА
	|	#УсловиеПеремещения,
	//>>БАА
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Период >= &ДатаНеликвидов И 
	|	ПартииТоваровКомпании.Период < &ДатаПретендентов И 
	|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И 
	|	ПартииТоваровКомпании.Партия.Дата <= &ДатаПретендентов И 
	|	(НЕ ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваров)
	|{ГДЕ
	|	ПартииТоваровКомпании.Номенклатура.*      КАК Номенклатура,
	|	ПартииТоваровКомпании.СкладКомпании.*     КАК СкладКомпании,
	|	ПартииТоваровКомпании.Партия.*            КАК Партия,
	|	ПартииТоваровКомпании.Партия.Контрагент.* КАК Контрагент,
	|	ПартииТоваровКомпании.СкладКомпании.Подразделение.* КАК Подразделение,
	|	ПартииТоваровКомпании.СкладКомпании.Организация.* КАК Организация}
	|СГРУППИРОВАТЬ ПО
	|	"+ТекстГруппировокРегистра+"
	|	ПартииТоваровКомпании.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ПартииТоваровКомпании.Количество)>0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	"+ТекстТаблицыИзРегистраИзмерения+"
	|	ПартииТоваровКомпании.Номенклатура,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	//<<БАА
	|	#УсловиеПеремещения,
	//>>БАА
	|	0
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Период >= &ДатаПретендентов И 
	|	ПартииТоваровКомпании.Период <= &ДатаКон И 
	|	ПартииТоваровКомпании.Партия.Дата <= &ДатаПретендентов И
	//<<БАА
	//|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И 
	//>>БАА
	|	(НЕ ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваров)
	|{ГДЕ
	|	ПартииТоваровКомпании.Номенклатура.*      КАК Номенклатура,
	|	ПартииТоваровКомпании.СкладКомпании.*     КАК СкладКомпании,
	|	ПартииТоваровКомпании.Партия.*            КАК Партия,
	|	ПартииТоваровКомпании.Партия.Контрагент.* КАК Контрагент,
	|	ПартииТоваровКомпании.СкладКомпании.Подразделение.* КАК Подразделение,
	|	ПартииТоваровКомпании.СкладКомпании.Организация.* КАК Организация}
	|СГРУППИРОВАТЬ ПО
	|	"+ТекстГруппировокРегистра+"
	|	ПартииТоваровКомпании.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ПартииТоваровКомпании.Количество)>0) КАК ТаблицаОстатков
	|СГРУППИРОВАТЬ ПО
	|	"+СтрЗаменить(ТекстТабРасходовГруппировки, "ТаблицаРегистра", "ТаблицаОстатков")+"
	|	ТаблицаОстатков.Номенклатура
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаОстатков.НачальныйЗапас2)>0 или СУММА(ТаблицаОстатков.НачальныйЗапас)>0) И 
	|	СУММА(ТаблицаОстатков.Оборот2) = 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТабПодходящихПартий
	|ИЗ
	|РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКон, Партия.Дата <= &ДатаПретендентов) КАК ПартииТоваровКомпанииОстатки
	|;
    |////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабНеликвидовИКандидатовВрем.*
	|ПОМЕСТИТЬ ТабНеликвидовИКандидатов
	|ИЗ
	|	ТабНеликвидовИКандидатовВрем КАК ТабНеликвидовИКандидатовВрем
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПодходящихПартий КАК ТабПодходящихПартий
	|		ПО ТабНеликвидовИКандидатовВрем.Номенклатура = ТабПодходящихПартий.Номенклатура
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабНеликвидовИКандидатов.Номенклатура КАК Номенклатура,
	|	Цены.Период КАК Период,
	|	Цены.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	ТабНеликвидовИКандидатов КАК ТабНеликвидовИКандидатов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК Цены
	|ПО
	|	ТабНеликвидовИКандидатов.Номенклатура = Цены.Номенклатура И 
	|	Цены.Период <= &ДатаКон И 
	|	Цены.ТипЦен = &ТипЦены И 
	|	Цены.ПодразделениеКомпании = &ТекПодразделение И 
	|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	Цены.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|ГДЕ
	|	Цены.Период <= &ДатаКон
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.Номенклатура
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ
	|	ЦеныПодразделения
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.Номенклатура = ТаблицаЦен.Номенклатура И 
	|	СрезПоследних.Период       = ТаблицаЦен.Период
	|СГРУППИРОВАТЬ ПО
	|	СрезПоследних.Номенклатура
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТаблицаЦен.Цена)>0
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабНеликвидовИКандидатов.Номенклатура КАК Номенклатура,
	|	Цены.Период КАК Период,
	|	Цены.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦенДляВсейКомпании
	|ИЗ
	|	ТабНеликвидовИКандидатов КАК ТабНеликвидовИКандидатов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК Цены
	|ПО
	|	ТабНеликвидовИКандидатов.Номенклатура = Цены.Номенклатура И 
	|	Цены.Период <= &ДатаКон И 
	|	Цены.ТипЦен = &ТипЦены И 
	|	Цены.ПодразделениеКомпании = &ВсяКомпания И 
	|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	Цены.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|ГДЕ
	|	Цены.Период <= &ДатаКон
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	СрезПоследнихДляВсейКомпании
	|ИЗ
	|	ТаблицаЦенДляВсейКомпании КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.Номенклатура
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ
	|	ЦеныДляВсейКомпании
	|ИЗ
	|	СрезПоследнихДляВсейКомпании КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦенДляВсейКомпании КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.Номенклатура = ТаблицаЦен.Номенклатура И 
	|	СрезПоследних.Период       = ТаблицаЦен.Период
	|СГРУППИРОВАТЬ ПО
	|	СрезПоследних.Номенклатура
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТаблицаЦен.Цена)>0
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследнихДляВсейКомпании
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦенДляВсейКомпании
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	"+СтрЗаменить(ТекстТабРасходовИзмерения, "ТаблицаРегистра.", "ТабРасхода.")+"
	|	ТабРасхода.Номенклатура,
	|	НАЧАЛОПЕРИОДА(ПартииТоваровКомпании.Период, МЕСЯЦ) КАК Период,
	//<<БАА
	//|	СУММА(выбор когда ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) тогда выбор когда ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваров или ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваровВПроизводство тогда 0 иначе ПартииТоваровКомпании.Количество конец иначе выбор когда ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ИзвлечениеТоваровИзПроизводства тогда -ПартииТоваровКомпании.Количество иначе 0 конец конец) КАК Количество
	|	#УсловиеПеремещения КАК Количество
	//>>БАА
	|ПОМЕСТИТЬ
	|	ТаблицаРасхода
	|ИЗ
	|	ТабНеликвидовИКандидатов КАК ТабРасхода
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ПО
	|	ТабРасхода.Номенклатура           = ПартииТоваровКомпании.Номенклатура И 
	//|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И 
	|	(НЕ ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваров) И 
	|	ПартииТоваровКомпании.Период <= &ДатаКон
	|	"+СтрЗаменить(СтрЗаменить(ТекстСоединенияТабРасходовОстатков, "ТаблицаРегистра.", "ТабРасхода."), "Остатки.", "ПартииТоваровКомпании.")+"
	|ГДЕ
	|	ПартииТоваровКомпании.Период <= &ДатаКон
	|{ГДЕ
	|	ПартииТоваровКомпании.Номенклатура.*      КАК Номенклатура,
	|	ПартииТоваровКомпании.СкладКомпании.*     КАК СкладКомпании,
	|	ПартииТоваровКомпании.Партия.*            КАК Партия,
	|	ПартииТоваровКомпании.Партия.Контрагент.* КАК Контрагент,
	|	ПартииТоваровКомпании.СкладКомпании.Подразделение.* КАК Подразделение,
	|	ПартииТоваровКомпании.СкладКомпании.Организация.* КАК Организация}
	|СГРУППИРОВАТЬ ПО
	|	"+СтрЗаменить(ТекстТабРасходовГруппировки, "ТаблицаРегистра.", "ТабРасхода.")+"
	|	ТабРасхода.Номенклатура,
	|	НАЧАЛОПЕРИОДА(ПартииТоваровКомпании.Период, МЕСЯЦ)
	|ИМЕЮЩИЕ
	|	СУММА(ПартииТоваровКомпании.Количество) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	"+СтрЗаменить(ТекстТабРасходовИзмерения, "ТаблицаРегистра.", "ТабПрихода.")+"
	|	ТабПрихода.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА ПартииТоваровКомпании.Партия = &ПартияТоваровОтрицательныхОстатков ТОГДА
	|					ПартииТоваровКомпании.Период
	|				ИНАЧЕ
	|					ПартииТоваровКомпании.Партия.Дата
	|			КОНЕЦ, МЕСЯЦ)) КАК Период,
	|	РАЗНОСТЬДАТ(МИНИМУМ(НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА ПартииТоваровКомпании.Партия = &ПартияТоваровОтрицательныхОстатков ТОГДА
	|					ПартииТоваровКомпании.Период
	|				ИНАЧЕ
	|					ПартииТоваровКомпании.Партия.Дата
	|			КОНЕЦ, МЕСЯЦ)), &ДатаКон, МЕСЯЦ) КАК КоличествоМесяцевБезПродаж
	|ПОМЕСТИТЬ
	|	ТаблицаПодсчетДнейБезПродаж
	|ИЗ
	|	ТабНеликвидовИКандидатов КАК ТабПрихода
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ПО
	|	ТабПрихода.Номенклатура           = ПартииТоваровКомпании.Номенклатура И 
	|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
	|	ПартииТоваровКомпании.Период <= &ДатаКон
	|	"+СтрЗаменить(СтрЗаменить(ТекстСоединенияТабРасходовОстатков, "ТаблицаРегистра.", "ТабПрихода."), "Остатки.", "ПартииТоваровКомпании.")+"
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаРасхода КАК ТабРасхода
	|ПО
	|	ТабПрихода.Номенклатура  = ТабРасхода.Номенклатура
	|	"+СтрЗаменить(СтрЗаменить(ТекстСоединенияТабРасходовРегистров, "ТаблицаРегистра.", "ТабПрихода."), "ТаблицаРасходов.", "ТабРасхода.")+"
	|ГДЕ
	|	ТабРасхода.Период ЕСТЬ NULL
	|{ГДЕ
	|	ПартииТоваровКомпании.Номенклатура.*      КАК Номенклатура,
	|	ПартииТоваровКомпании.СкладКомпании.*     КАК СкладКомпании,
	|	ПартииТоваровКомпании.Партия.*            КАК Партия,
	|	ПартииТоваровКомпании.Партия.Контрагент.* КАК Контрагент,
	|	ПартииТоваровКомпании.СкладКомпании.Подразделение.* КАК Подразделение,
	|	ПартииТоваровКомпании.СкладКомпании.Организация.*   КАК Организация}
	|СГРУППИРОВАТЬ ПО
	|	"+СтрЗаменить(ТекстТабРасходовГруппировки, "ТаблицаРегистра.", "ТабПрихода.")+"
	|	ТабПрихода.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ПартииТоваровКомпании.Количество) <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	"+СтрЗаменить(ТекстТабРасходовИзмерения, "ТаблицаРегистра.", "ТаблицаРасхода.")+"
	|	ТаблицаРасхода.Номенклатура,
	|	МАКСИМУМ(ТаблицаРасхода.Период),
	|	РАЗНОСТЬДАТ(МАКСИМУМ(ТаблицаРасхода.Период), &ДатаКон, МЕСЯЦ)
	|ИЗ
	|	ТаблицаРасхода КАК ТаблицаРасхода
	|СГРУППИРОВАТЬ ПО
	|	"+СтрЗаменить(ТекстТабРасходовГруппировки, "ТаблицаРегистра.", "ТаблицаРасхода.")+"
	|	ТаблицаРасхода.Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	"+СтрЗаменить(ТекстТабРасходовИзмерения, "ТаблицаРегистра.", "ТаблицаПодсчетДнейБезПродаж.")+"
	|	ТаблицаПодсчетДнейБезПродаж.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТаблицаПодсчетДнейБезПродаж.КоличествоМесяцевБезПродаж) КАК КоличествоМесяцевБезПродаж,
	|	СУММА(ЕСТЬNULL(ТаблицаРасходов.Количество, 0))/&КоличествоМесяцевДляРасчета КАК ТекущийРасход
	|ПОМЕСТИТЬ
	|	ТаблицаПрошлыхПродаж
	|ИЗ
	|	ТаблицаПодсчетДнейБезПродаж КАК ТаблицаПодсчетДнейБезПродаж
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаРасхода КАК ТаблицаРасходов
	|ПО
	|	ТаблицаПодсчетДнейБезПродаж.Номенклатура  = ТаблицаРасходов.Номенклатура И 
	|	ТаблицаПодсчетДнейБезПродаж.Период       >= ТаблицаРасходов.Период И 
	|	(РАЗНОСТЬДАТ(ТаблицаРасходов.Период, ТаблицаПодсчетДнейБезПродаж.Период, МЕСЯЦ) < &КоличествоМесяцевДляРасчета)
	|	"+СтрЗаменить(ТекстСоединенияТабРасходовРегистров, "ТаблицаРегистра.", "ТаблицаПодсчетДнейБезПродаж.") + "
	|СГРУППИРОВАТЬ ПО
	|	"+СтрЗаменить(ТекстТабРасходовГруппировки, "ТаблицаРегистра.", "ТаблицаПодсчетДнейБезПродаж.")+"
	|	ТаблицаПодсчетДнейБезПродаж.Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПодсчетДнейБезПродаж
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаРасхода
	|;
	|
	|ВЫБРАТЬ
	|	"+СтрЗаменить(ТекстТабРасходовИзмерения, "ТаблицаРегистра.", "ТабНеликвидовИКандидатов.")+"
	|	ТабНеликвидовИКандидатов.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТабНеликвидовИКандидатов.ГруппаТоваров = 1 ТОГДА
	|			 ""Неликвидные товары""
	|		ИНАЧЕ
	|			""Претенденты в неликвидные товары""
	|	КОНЕЦ КАК ГруппаТоваров,
	|	ТабНеликвидовИКандидатов.Себестоимость КАК Себестоимость,
	|	ТабНеликвидовИКандидатов.СебестоимостьУпр КАК СебестоимостьУпр,
	|	ТабНеликвидовИКандидатов.КонечныйЗапас КАК Количество,
	|	ТабНеликвидовИКандидатов.КонечныйЗапас * ЕСТЬNULL(ЦеныПодразделения.Цена, ЕСТЬNULL(ЦеныДляВсейКомпании.Цена, 0)) КАК СебестоимостьПоТипуЦен,
	|	ТабРасчетаДолей.ОбщКоличПоКаталогу КАК ОбщКоличПоКаталогу,
	|	ЕСТЬNULL(ТаблицаПрошлыхПродаж.КоличествоМесяцевБезПродаж, 0) КАК КоличествоМесяцевБезПродаж,
	|	ЕСТЬNULL(ТаблицаПрошлыхПродаж.ТекущийРасход, 0) КАК ТекущийРасход," + ?(ПоВалютеУчета, "
	|	ТабНеликвидовИКандидатов.Номенклатура.ВалютаУчета", "
	|	&ВалютаТипаЦен") +" КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаПрошлыхПродаж.ТекущийРасход ЕСТЬ NULL ИЛИ ТаблицаПрошлыхПродаж.ТекущийРасход = 0 ТОГДА
	|			0
	|		ИНАЧЕ
	|			ТабНеликвидовИКандидатов.КонечныйЗапас/ТаблицаПрошлыхПродаж.ТекущийРасход
	|	КОНЕЦ КАК ЗапасНаПродажу,
	|	ВЫБОР
	|		КОГДА ТабРасчетаДолей.ОбщСумма ЕСТЬ NULL ИЛИ ТабРасчетаДолей.ОбщСумма = 0 
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТабНеликвидовИКандидатов.Себестоимость, 0) / ТабРасчетаДолей.ОбщСумма * 100
	|	КОНЕЦ КАК ДоляСебестоимости,
	|	ВЫБОР
	|		КОГДА ТабРасчетаДолей.ОбщКоличПоКаталогу ЕСТЬ NULL ИЛИ ТабРасчетаДолей.ОбщКоличПоКаталогу = 0 
	|			ТОГДА 100
	|		ИНАЧЕ ТабНеликвидовИКандидатов.КонечныйЗапас / ТабРасчетаДолей.ОбщКоличПоКаталогу * 100
	|	КОНЕЦ КАК ДоляВАссортименте
	|	" + СтрЗапросаСвойств + "
	|{ВЫБРАТЬ
	|	" + СокрЛП(ТекстВыбора) + "
	|	Номенклатура.*          КАК Номенклатура,
	|	Количество              КАК Количество,
	|	Себестоимость           КАК Себестоимость,
	|	ЗапасНаПродажу          КАК ЗапасНаПродажу,
	|	КоличествоМесяцевБезПродаж КАК КоличествоМесяцевБезПродаж,
	|	СебестоимостьПоТипуЦен  КАК СебестоимостьПоТипуЦен,
	|	ДоляВАссортименте       КАК ДоляВАссортименте,
	|	ДоляСебестоимости       КАК ДоляСебестоимости,
	|	Валюта                  КАК Валюта,
	|	ТекущийРасход           КАК ТекущийРасход,
	|	ГруппаТоваров           КАК ГруппаТоваров
	|	" + СтрПсевдонимСвойств + "
	|}
	|ИЗ
	|	ТабНеликвидовИКандидатов КАК ТабНеликвидовИКандидатов
	|{ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТабРасчетаДолей КАК ТабРасчетаДолей
	|ПО
	|	"+ ?(ЕстьСклад, "ТабРасчетаДолей.СкладКомпании = ТабНеликвидовИКандидатов.СкладКомпании", "ИСТИНА") +"}
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ЦеныПодразделения КАК ЦеныПодразделения
	|ПО
	|	ТабНеликвидовИКандидатов.Номенклатура = ЦеныПодразделения.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ЦеныДляВсейКомпании КАК ЦеныДляВсейКомпании
	|ПО
	|	ТабНеликвидовИКандидатов.Номенклатура = ЦеныДляВсейКомпании.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаПрошлыхПродаж КАК ТаблицаПрошлыхПродаж
	|ПО
	|	ТабНеликвидовИКандидатов.Номенклатура  = ТаблицаПрошлыхПродаж.Номенклатура
	|	"+СтрЗаменить(СтрЗаменить(ТекстСоединенияТабРасходовРегистров,"ТаблицаРегистра.","ТабНеликвидовИКандидатов."), "ТаблицаРасходов.", "ТаблицаПрошлыхПродаж.")+"
	|" + СтрСоединенийСвойств + "
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ГруппаТоваров = 1 ТОГДА
	|			ИСТИНА
	|		КОГДА ТабНеликвидовИКандидатов.КонечныйЗапас ЕСТЬ NULL ИЛИ ТабНеликвидовИКандидатов.КонечныйЗапас = 0 ТОГДА
	|			ЛОЖЬ
	|		КОГДА ТаблицаПрошлыхПродаж.ТекущийРасход ЕСТЬ NULL ИЛИ ТаблицаПрошлыхПродаж.ТекущийРасход = 0 ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			(ТабНеликвидовИКандидатов.КонечныйЗапас / ТаблицаПрошлыхПродаж.ТекущийРасход) >= &КритичныйЗапас
	|	КОНЕЦ
	|{ГДЕ
	|	ТабНеликвидовИКандидатов.Номенклатура.*      КАК Номенклатура
	|	" + СтрОтборСвойств + "
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Номенклатура.* КАК Номенклатура,
	|	ГруппаТоваров  КАК ГруппаТоваров,
	|	" + СокрЛП(ТекстУпорядочить) + "
	|	ЗапасНаПродажу  КАК ЗапасНаПродажу,
	|	КоличествоМесяцевБезПродаж КАК КоличествоМесяцевБезПродаж
	|	" + СтрПсевдонимСвойств + "	
	|}
	|{ИТОГИ ПО
	|	Номенклатура.* КАК Номенклатура
	|	"+ ?(ПустаяСтрока(СокрЛП(ТекстИтогов)),"",",") + СокрЛП(Лев(ТекстИтогов, СтрДлина(ТекстИтогов) - 2)) + "
	|	" + СтрПсевдонимСвойств + "
	|}
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Себестоимость),
	|	СРЕДНЕЕ(ЗапасНаПродажу),
	|	ВЫБОР
	|		КОГДА Номенклатура ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			СУММА(ТекущийРасход)
	|		КОНЕЦ КАК ТекущийРасход,
	|	МАКСИМУМ(Валюта),
	|	СРЕДНЕЕ(КоличествоМесяцевБезПродаж),
	|	"+?(ЕстьСклад, СтрокаИтоговВыборПоСкладу2, "СУММА(ДоляВАссортименте) КАК ДоляВАссортименте") + ",
	|	"+?(ЕстьСклад, СтрокаИтоговВыборПоСкладу, "СУММА(ДоляСебестоимости) КАК ДоляСебестоимости")  + ?(ПоВалютеУчета, ",
	|	ВЫБОР
	|		КОГДА Номенклатура ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			СУММА(СебестоимостьПоТипуЦен)
	|	КОНЕЦ КАК СебестоимостьПоТипуЦен", ",
	|	СУММА(СебестоимостьПоТипуЦен)")+СтрЗапросаИтогиСвойств + "
	|ПО
	|	ОБЩИЕ,
	|	ГруппаТоваров,
	|	Номенклатура"+?(ЕстьСклад, ","+Символы.ПС+"СкладКомпании","")+"
	|АВТОУПОРЯДОЧИВАНИЕ";  
	
	
	Если НеУчитыватьПеремещения Тогда
		//ТекстЗапросаРезультат = СтрЗаменить(ТекстЗапросаРезультат, "#УсловиеПеремещения", "СУММА(выбор когда ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) тогда выбор когда ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваров или ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваровВПроизводство или ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ИзвлечениеТоваровИзПроизводства тогда 0 иначе ПартииТоваровКомпании.Количество конец иначе 0 конец)")
		ТекстЗапросаРезультат = СтрЗаменить(ТекстЗапросаРезультат, "#УсловиеПеремещения", "СУММА(выбор когда ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) тогда выбор когда ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваров или ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваровВПроизводство или ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ИзвлечениеТоваровИзПроизводства тогда 0 иначе 0 конец иначе 0 конец)")
	Иначе
		ТекстЗапросаРезультат = СтрЗаменить(ТекстЗапросаРезультат, "#УсловиеПеремещения", "СУММА(выбор когда ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) тогда ПартииТоваровКомпании.Количество иначе выбор когда ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ИзвлечениеТоваровИзПроизводства тогда -ПартииТоваровКомпании.Количество иначе 0 конец конец)")
	КонецЕсли;	
	
	Возврат ТекстЗапросаРезультат;
	
КонецФункции

// возвращает имя поля запроса
// Параметры:
//	ТекПоле текущий путь к данным
Функция ПолучитьИмяПоля(ТекПоле = Неопределено)
	
	Если ТекПоле = Неопределено Тогда
		Возврат "Неопределено";
	КонецЕсли;
	
	ПозицияТочки = Найти(ТекПоле, ".");
	Если ПозицияТочки = 0 Тогда
		Возврат ТекПоле;
	Иначе
		Возврат Сред(ТекПоле, ПозицияТочки + 1);
	КонецЕсли;
	
КонецФункции

// проверка заполнения
Функция КорректностьЗаполнения(ПродолжитьФормирование) Экспорт
	
	ЕстьНоменклатура = Ложь;
	
	СтрокаНоменклатуры = ИзмеренияСтроки.Найти("Номенклатура", "ПутьКДанным");
	Если СтрокаНоменклатуры <> Неопределено И СтрокаНоменклатуры.Использование Тогда
		ЕстьНоменклатура = Истина;
	КонецЕсли;
	
	КолонкаНоменклатуры = ИзмеренияКолонки.Найти("Номенклатура", "ПутьКДанным");
	Если КолонкаНоменклатуры <> Неопределено И КолонкаНоменклатуры.Использование Тогда
		ЕстьНоменклатура = Истина;
	КонецЕсли;
	
	ОтборНоменклатуры = ПостроительОтчета.Отбор.Найти("Номенклатура");
	Если ОтборНоменклатуры <> Неопределено Тогда
		Если ОтборНоменклатуры.ВидСравнения = ВидСравнения.Равно И ОтборНоменклатуры.Использование Тогда
			ЕстьНоменклатура = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЕстьНоменклатура Тогда
		Сообщить("Поле номенклатура отсутствует в группировках строк, колонок и отборах."+Символы.ПС+"Поле номенклатура будет добавлено в группировки строки.", СтатусСообщения.Важное);
		Если СтрокаНоменклатуры = Неопределено И КолонкаНоменклатуры = Неопределено Тогда
			СтрокаНоменклатуры = ИзмеренияСтроки.Добавить();
			СтрокаНоменклатуры.ПутьКДанным   = "Номенклатура";
			СтрокаНоменклатуры.Представление = "Номенклатура";
			СтрокаНоменклатуры.ТипИзмерения  = "Элементы";
		ИначеЕсли СтрокаНоменклатуры = Неопределено Тогда
			СтрокаНоменклатуры = КолонкаНоменклатуры;
		КонецЕсли;
		СтрокаНоменклатуры.Использование = Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура СброситьГруппировку(СтрокаДерева)
	
	Для Каждого ТекСтрока Из СтрокаДерева.Строки Цикл
		ТекСтрока.Измерение = Ложь;
		СброситьГруппировку(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
	ПостроительОтчета.Параметры.Вставить("ПартияТоваровОтрицательныхОстатков", Константы.ПартияТоваровОтрицательныхОстатков.Получить());
	
	Для Каждого ТекСтрока Из ДеревоДоступныхПолей.Строки Цикл
		СброситьГруппировку(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт

	УстановитьЗначенияПараметров();
	УбратьИтогиДляДолей();
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат,, глПрава);
	Возврат Результат;
	
КонецФункции // ЗаполнитьНачальныеНастройки()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

// Устанавливает значения параметров в построитель
Процедура УстановитьЗначенияПараметров() Экспорт
	
	ПостроительОтчета.Параметры.Вставить("ДатаНеликвидов",    ДатаНеликвидов);
	ПостроительОтчета.Параметры.Вставить("ДатаПретендентов",  ДатаПретендентов);
	ПостроительОтчета.Параметры.Вставить("КритичныйЗапас",    КритичныйЗапас);
	Если ТипЦенРасчетаСебестоимости.ВВалютеУчета Тогда
		ПостроительОтчета.Параметры.Вставить("ВалютаТипаЦен", Справочники.Валюты.ПустаяСсылка());
	Иначе
		ПостроительОтчета.Параметры.Вставить("ВалютаТипаЦен", ТипЦенРасчетаСебестоимости.ВалютаЦены);
	КонецЕсли;
	ПостроительОтчета.Параметры.Вставить("ТипЦены",           ТипЦенРасчетаСебестоимости);
	ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ДатаКонца));
	Если КоличествоДнейДляРасчетаТекущегоРасхода < 30 Тогда
		ПостроительОтчета.Параметры.Вставить("КоличествоМесяцевДляРасчета", 1);
	Иначе
		ПостроительОтчета.Параметры.Вставить("КоличествоМесяцевДляРасчета", Окр(КоличествоДнейДляРасчетаТекущегоРасхода/30,0,1));
	КонецЕсли;
	ПостроительОтчета.Параметры.Вставить("ТекПодразделение", ?(обЗначениеНеЗаполнено(ПодразделениеДляЦены), ПараметрыСеанса.ПодразделениеКомпании, ПодразделениеДляЦены));
	ПостроительОтчета.Параметры.Вставить("ВсяКомпания",      Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
КонецПроцедуры

// Убирает итоги для иерархии долей
Процедура УбратьИтогиДляДолей()
	
	ЕстьСклад = ((ИзмеренияСтроки.Найти("СкладКомпании", "ПутьКДанным")<>Неопределено) ИЛИ (ИзмеренияКолонки.Найти("СкладКомпании", "ПутьКДанным")<>Неопределено));
	Если ЕстьСклад Тогда
		Если Не Показатели.Найти("ДоляСебестоимости", "Имя").Использование Тогда Возврат; КонецЕсли;
		ПозицияНоменклатуры = 0;
		Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
			Если Найти(ТекСтрока.ПутьКДанным, "СкладКомпании")>0 Тогда
				ПозицияНоменклатуры = ИзмеренияСтроки.Индекс(ТекСтрока);
				Прервать;
			КонецЕсли;
			ПозицияНоменклатуры = ПозицияНоменклатуры+1;
		КонецЦикла;
		
		Для Индекс=0 По ИзмеренияСтроки.Количество()-1 Цикл
			ТекСтрока = ИзмеренияСтроки[Индекс];
			ПараметрыПолейИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекСтрока.ПутьКДанным, ПараметрыИспользованияПолейИПоказателей);
			Если ПараметрыПолейИзмерения=Неопределено Тогда Продолжить; КонецЕсли;
			
			Использование = Индекс >= ПозицияНоменклатуры;
			Если ПараметрыПолейИзмерения.Свойство("Использование") Тогда
				РесурсыПоля = ПараметрыПолейИзмерения.Использование.Ресурсы;
				Для Каждого ТекРесурс Из РесурсыПоля Цикл
					Если Найти(ТекРесурс.Ключ, "ДоляСебестоимости")=1 Тогда
						РесурсыПоля.Вставить(ТекРесурс.Ключ, Использование);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ТекСтрока.ТипИзмерения = "Иерархия" Тогда
				ПараметрыПолейИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекСтрока.ПутьКДанным+".Родитель", ПараметрыИспользованияПолейИПоказателей);
				Если ПараметрыПолейИзмерения=Неопределено Тогда Продолжить; КонецЕсли;
				РесурсыПоля = ПараметрыПолейИзмерения.Использование.Ресурсы;
				Для Каждого ТекРесурс Из РесурсыПоля Цикл
					Если Найти(ТекРесурс.Ключ, "ДоляСебестоимости")=1 Тогда
						РесурсыПоля.Вставить(ТекРесурс.Ключ, Ложь);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если Не Показатели.Найти("ДоляВАссортименте", "Имя").Использование Тогда Возврат; КонецЕсли;
		ПозицияНоменклатуры = 0;
		Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
			Если Найти(ТекСтрока.ПутьКДанным, "СкладКомпании")>0 Тогда
				ПозицияНоменклатуры = ИзмеренияСтроки.Индекс(ТекСтрока);
				Прервать;
			КонецЕсли;
			ПозицияНоменклатуры = ПозицияНоменклатуры+1;
		КонецЦикла;
		
		Для Индекс=0 По ИзмеренияСтроки.Количество()-1 Цикл
			ТекСтрока = ИзмеренияСтроки[Индекс];
			ПараметрыПолейИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекСтрока.ПутьКДанным, ПараметрыИспользованияПолейИПоказателей);
			Если ПараметрыПолейИзмерения=Неопределено Тогда Продолжить; КонецЕсли;
			
			Использование = Индекс >= ПозицияНоменклатуры;
			Если ПараметрыПолейИзмерения.Свойство("Использование") Тогда
				РесурсыПоля = ПараметрыПолейИзмерения.Использование.Ресурсы;
				Для Каждого ТекРесурс Из РесурсыПоля Цикл
					Если Найти(ТекРесурс.Ключ, "ДоляВАссортименте")=1 Тогда
						РесурсыПоля.Вставить(ТекРесурс.Ключ, Использование);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ТекСтрока.ТипИзмерения = "Иерархия" Тогда
				ПараметрыПолейИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекСтрока.ПутьКДанным+".Родитель", ПараметрыИспользованияПолейИПоказателей);
				Если ПараметрыПолейИзмерения=Неопределено Тогда Продолжить; КонецЕсли;
				РесурсыПоля = ПараметрыПолейИзмерения.Использование.Ресурсы;
				Для Каждого ТекРесурс Из РесурсыПоля Цикл
					Если Найти(ТекРесурс.Ключ, "ДоляВАссортименте")=1 Тогда
						РесурсыПоля.Вставить(ТекРесурс.Ключ, Ложь);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если НЕ Показатели.Найти("ТекущийРасход", "Имя").Использование Тогда Возврат; КонецЕсли;
	ПозицияНоменклатуры = 0;
	Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
		Если Найти(ТекСтрока.ПутьКДанным, "Номенклатура")>0 Тогда
			ПозицияНоменклатуры = ИзмеренияСтроки.Индекс(ТекСтрока);
			Прервать;
		КонецЕсли;
		ПозицияНоменклатуры = ПозицияНоменклатуры+1;
	КонецЦикла;
	
	Для Индекс=0 По ИзмеренияСтроки.Количество()-1 Цикл
		ТекСтрока = ИзмеренияСтроки[Индекс];
		ПараметрыПолейИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекСтрока.ПутьКДанным, ПараметрыИспользованияПолейИПоказателей);
		Если ПараметрыПолейИзмерения=Неопределено Тогда Продолжить; КонецЕсли;
		
		Использование = Индекс >= ПозицияНоменклатуры;
		Если ПараметрыПолейИзмерения.Свойство("Использование") Тогда
			РесурсыПоля = ПараметрыПолейИзмерения.Использование.Ресурсы;
			Для Каждого ТекРесурс Из РесурсыПоля Цикл
				Если Найти(ТекРесурс.Ключ, "ТекущийРасход")=1 Тогда
					РесурсыПоля.Вставить(ТекРесурс.Ключ, Использование);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ТекСтрока.ТипИзмерения = "Иерархия" Тогда
			ПараметрыПолейИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекСтрока.ПутьКДанным+".Родитель", ПараметрыИспользованияПолейИПоказателей);
			Если ПараметрыПолейИзмерения=Неопределено Тогда Продолжить; КонецЕсли;
			РесурсыПоля = ПараметрыПолейИзмерения.Использование.Ресурсы;
			Для Каждого ТекРесурс Из РесурсыПоля Цикл
				Если Найти(ТекРесурс.Ключ, "ТекущийРасход")=1 Тогда
					РесурсыПоля.Вставить(ТекРесурс.Ключ, Ложь);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры //УбратьИтогиДляЦен()

// корректировка таблицы заголовка
Процедура ОбработкаТаблицыЗаголовка(ТаблицаЗаголовка) Экспорт
	
	НоваяСтрока = ТаблицаЗаголовка.Вставить(1);
	НоваяСтрока.Текст = "Тип цены: " + Строка(ТипЦенРасчетаСебестоимости);
	НоваяСтрока.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
	НоваяСтрока.Шрифт = Новый Шрифт(ТаблицаЗаголовка[0].Шрифт,, 10, Истина);
	
КонецПроцедуры // ОбработкаТаблицыЗаголовка()
//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяОтчетаДвиженийСОстатками      = "АнализНеликвидовЗапчастей";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей  = Новый Структура();

//ДатаКонца        = КонецДня(ДатаКонца);
ДатаНеликвидов   = НачалоДня(ДобавитьМесяц(ТекущаяДата(), -24));
ДатаПретендентов = НачалоДня(ДобавитьМесяц(ТекущаяДата(), -12));
//ДатаКритЗапаса   = НачалоДня(ДобавитьМесяц(ТекущаяДата(), -8));

// Установим значения по умолчанию
ЗапасПервыйПредел = (НачалоДня(ДатаКонца)-ДатаНеликвидов)/(60*60*24);
ЗапасВторойПредел = (НачалоДня(ДатаКонца)-ДатаПретендентов)/(60*60*24);
КритичныйЗапас    = 8;

КоличествоДнейДляРасчетаТекущегоРасхода = 90;
ТипЦенРасчетаСебестоимости              = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
ПодразделениеДляЦены                    = ПараметрыСеанса.ПодразделениеКомпании;

#КонецЕсли
